(function () {

    "use strict";

    $.AnyPicker.i18n["fa"] = $.extend(true, $.AnyPicker.i18n["fa"], {
        defaults: {
            i18n: 
            {
                veryShortDays: ["ی", "د", "س", "چ", "پ", "ج", "ش"],
                shortDays: ["یکشنبه", "دوشنبه", "سه‌شنبه", "چهارشنبه", "پنج‌شنبه", "جمعه", "شنبه"],
                fullDays: ["یکشنبه", "دوشنبه", "سه‌شنبه", "چهارشنبه", "پنج‌شنبه", "جمعه", "شنبه"],
                shortMonths: ["فروردین", "اردیبهشت", "خرداد", "تیر", "مرداد", "شهریور", "مهر", "آبان", "آذر", "دی", "بهمن", "اسفند"],
                fullMonths: ["فروردین", "اردیبهشت", "خرداد", "تیر", "مرداد", "شهریور", "مهر", "آبان", "آذر", "دی", "بهمن", "اسفند"],
                numbers: ["۰", "۱", "۲", "۳", "۴", "۵", "۶", "۷", "۸", "۹"],
                meridiem: 
                {
                    a: ["ق.ض.", "ب.ض."],
                    aa: ["ق.ض.", "ب.ض."],
                    A: ["ق.ض.", "ب.ض."],
                    AA: ["ق.ض.", "ب.ض."]
                },

                componentLabels: {
                    date: "تاریخ",
                    day: "روز",
                    month: "ماه",
                    year: "سال",
                    hours: "ساعت",
                    minutes: "دقیقه",
                    seconds: "ثانیه",
                    meridiem: "Meridiem"
                }
            },
        }
    });

})();